{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(assignments(),settings())/$entity",
  "@odata.type": "#microsoft.graph.deviceManagementConfigurationPolicy",
  "@odata.id": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)",
  "@odata.editLink": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)",
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2025-09-15T13:05:17.3824512Z",
  "creationSource": null,
  "description": "NOTE: For 24H2+ devices only. Disables built-in Administrator account.",
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2025-10-03T10:47:33.0250112Z",
  "name": "Win - OIB - SC - Device Security - D - Local Security Policies (24H2+) - v3.6",
  "platforms@odata.type": "#microsoft.graph.deviceManagementConfigurationPlatforms",
  "platforms": "windows10",
  "priorityMetaData": null,
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0"
  ],
  "settingCount": 28,
  "technologies@odata.type": "#microsoft.graph.deviceManagementConfigurationTechnologies",
  "technologies": "mdm",
  "id": "b1947ff6-8a1b-4f47-b313-1aaa5df282f6",
  "templateReference": {
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationPolicyTemplateReference",
    "templateId": "",
    "templateFamily@odata.type": "#microsoft.graph.deviceManagementConfigurationTemplateFamily",
    "templateFamily": "none",
    "templateDisplayName": null,
    "templateDisplayVersion": null
  },
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/assignments",
  "settings@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings",
  "settings@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings/$ref",
  "settings@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings",
  "settings": [
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00270\u0027)",
      "@odata.editLink": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00270\u0027)",
      "id": "0",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_accounts_enableadministratoraccountstatus",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_accounts_enableadministratoraccountstatus_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00270\u0027)/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00270\u0027)/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00271\u0027)",
      "@odata.editLink": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00271\u0027)",
      "id": "1",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_accounts_enableguestaccountstatus",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_accounts_enableguestaccountstatus_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00271\u0027)/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00271\u0027)/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00272\u0027)",
      "@odata.editLink": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00272\u0027)",
      "id": "2",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_accounts_limitlocalaccountuseofblankpasswordstoconsolelogononly",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_accounts_limitlocalaccountuseofblankpasswordstoconsolelogononly_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00272\u0027)/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00272\u0027)/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00273\u0027)",
      "@odata.editLink": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00273\u0027)",
      "id": "3",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_displayuserinformationwhenthesessionislocked",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_displayuserinformationwhenthesessionislocked_2",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00273\u0027)/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00273\u0027)/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00274\u0027)",
      "@odata.editLink": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00274\u0027)",
      "id": "4",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_donotdisplaylastsignedin",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_donotdisplaylastsignedin_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00274\u0027)/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00274\u0027)/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00275\u0027)",
      "@odata.editLink": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00275\u0027)",
      "id": "5",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_donotdisplayusernameatsignin",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_donotdisplayusernameatsignin_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00275\u0027)/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00275\u0027)/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00276\u0027)",
      "@odata.editLink": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00276\u0027)",
      "id": "6",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_donotrequirectrlaltdel",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_donotrequirectrlaltdel_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00276\u0027)/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00276\u0027)/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00277\u0027)",
      "@odata.editLink": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00277\u0027)",
      "id": "7",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_messagetextforusersattemptingtologon",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "simpleSettingCollectionValue@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSimpleSettingValue)",
        "simpleSettingCollectionValue": [
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
            "settingValueTemplateReference": null,
            "value": "This computer system is the property of %customer_name% and is authorised for use by employees and designated contractors only. Users have no explicit or implicit expectation of privacy whilst using the applications, infrastructure and services provided by %customer_name%. Any or all users of this system and all files on this system may be intercepted, monitored, recorded, copied, audited, inspected and disclosed to authorised site, company and law enforcement personnel."
          }
        ]
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00277\u0027)/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00277\u0027)/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00278\u0027)",
      "@odata.editLink": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00278\u0027)",
      "id": "8",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_smartcardremovalbehavior",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_smartcardremovalbehavior_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00278\u0027)/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00278\u0027)/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00279\u0027)",
      "@odata.editLink": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00279\u0027)",
      "id": "9",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkclient_digitallysigncommunicationsalways",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkclient_digitallysigncommunicationsalways_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00279\u0027)/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u00279\u0027)/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002710\u0027)",
      "@odata.editLink": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002710\u0027)",
      "id": "10",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkclient_sendunencryptedpasswordtothirdpartysmbservers",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkclient_sendunencryptedpasswordtothirdpartysmbservers_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002710\u0027)/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002710\u0027)/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002711\u0027)",
      "@odata.editLink": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002711\u0027)",
      "id": "11",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkserver_digitallysigncommunicationsalways",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkserver_digitallysigncommunicationsalways_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002711\u0027)/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002711\u0027)/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002712\u0027)",
      "@odata.editLink": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002712\u0027)",
      "id": "12",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networkaccess_donotallowanonymousenumerationofsamaccounts",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networkaccess_donotallowanonymousenumerationofsamaccounts_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002712\u0027)/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002712\u0027)/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002713\u0027)",
      "@odata.editLink": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002713\u0027)",
      "id": "13",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networkaccess_donotallowanonymousenumerationofsamaccountsandshares",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networkaccess_donotallowanonymousenumerationofsamaccountsandshares_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002713\u0027)/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002713\u0027)/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002714\u0027)",
      "@odata.editLink": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002714\u0027)",
      "id": "14",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networkaccess_restrictanonymousaccesstonamedpipesandshares",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networkaccess_restrictanonymousaccesstonamedpipesandshares_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002714\u0027)/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002714\u0027)/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002715\u0027)",
      "@odata.editLink": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002715\u0027)",
      "id": "15",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networkaccess_restrictclientsallowedtomakeremotecallstosam",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "simpleSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "O:BAG:BAD:(A;;RC;;;BA)"
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002715\u0027)/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002715\u0027)/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002716\u0027)",
      "@odata.editLink": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002716\u0027)",
      "id": "16",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_donotstorelanmanagerhashvalueonnextpasswordchange",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_donotstorelanmanagerhashvalueonnextpasswordchange_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002716\u0027)/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002716\u0027)/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002717\u0027)",
      "@odata.editLink": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002717\u0027)",
      "id": "17",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_lanmanagerauthenticationlevel",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_lanmanagerauthenticationlevel_5",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002717\u0027)/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002717\u0027)/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002718\u0027)",
      "@odata.editLink": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002718\u0027)",
      "id": "18",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_minimumsessionsecurityforntlmsspbasedclients",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_minimumsessionsecurityforntlmsspbasedclients_537395200",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002718\u0027)/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002718\u0027)/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002719\u0027)",
      "@odata.editLink": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002719\u0027)",
      "id": "19",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_minimumsessionsecurityforntlmsspbasedservers",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_minimumsessionsecurityforntlmsspbasedservers_537395200",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002719\u0027)/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002719\u0027)/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002720\u0027)",
      "@odata.editLink": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002720\u0027)",
      "id": "20",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_behavioroftheelevationpromptforadministrators",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_behavioroftheelevationpromptforadministrators_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002720\u0027)/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002720\u0027)/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002721\u0027)",
      "@odata.editLink": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002721\u0027)",
      "id": "21",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_behavioroftheelevationpromptforstandardusers",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_behavioroftheelevationpromptforstandardusers_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002721\u0027)/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002721\u0027)/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002722\u0027)",
      "@odata.editLink": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002722\u0027)",
      "id": "22",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_detectapplicationinstallationsandpromptforelevation",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_detectapplicationinstallationsandpromptforelevation_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002722\u0027)/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002722\u0027)/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002723\u0027)",
      "@odata.editLink": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002723\u0027)",
      "id": "23",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_onlyelevateuiaccessapplicationsthatareinstalledinsecurelocations",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_onlyelevateuiaccessapplicationsthatareinstalledinsecurelocations_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002723\u0027)/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002723\u0027)/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002724\u0027)",
      "@odata.editLink": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002724\u0027)",
      "id": "24",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_runalladministratorsinadminapprovalmode",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_runalladministratorsinadminapprovalmode_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002724\u0027)/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002724\u0027)/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002725\u0027)",
      "@odata.editLink": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002725\u0027)",
      "id": "25",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_switchtothesecuredesktopwhenpromptingforelevation",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_switchtothesecuredesktopwhenpromptingforelevation_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002725\u0027)/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002725\u0027)/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002726\u0027)",
      "@odata.editLink": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002726\u0027)",
      "id": "26",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_useadminapprovalmode",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_useadminapprovalmode_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002726\u0027)/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002726\u0027)/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002727\u0027)",
      "@odata.editLink": "deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002727\u0027)",
      "id": "27",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_virtualizefileandregistrywritefailurestoperuserlocations",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_virtualizefileandregistrywritefailurestoperuserlocations_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002727\u0027)/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/settings(\u002727\u0027)/settingDefinitions"
    }
  ],
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/microsoft.graph.assign"
  },
  "#microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget": {
    "title": "microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget"
  },
  "#microsoft.graph.createCopy": {
    "title": "microsoft.graph.createCopy",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/microsoft.graph.createCopy"
  },
  "#microsoft.graph.reorder": {
    "title": "microsoft.graph.reorder",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/microsoft.graph.reorder"
  },
  "#microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget": {
    "title": "microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget"
  },
  "#microsoft.graph.setEnrollmentTimeDeviceMembershipTarget": {
    "title": "microsoft.graph.setEnrollmentTimeDeviceMembershipTarget",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/microsoft.graph.setEnrollmentTimeDeviceMembershipTarget"
  },
  "#microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy": {
    "title": "microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027b1947ff6-8a1b-4f47-b313-1aaa5df282f6\u0027)/microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy"
  }
}
